:PROPERTIES:
:ID: 11E13D6C-39EE-445A-A758-1DEA7E83D589
:END:
#+title: Get
#+description: Get
#+type: recipe
#+level: cross
#+filetags: :recipe:shell:countries:
#+created: 2026-05-21
#+updated: 2026-05-21

Get all countries in the system.

#+name: countries-get
#+begin_src ores-shell :exports none
countries get
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<countries-get>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.8
Type 'help' for available commands, 'exit' to quit.

ores-shell> +---------+---------+---------+---------+-----------------------------------+---------------------------------------------------------------------------+----------------------+-------------+-------------------------------+
| Alpha-2 | Alpha-3 | Numeric | Version | Name                              | Official Name                                                             | Change Reason        | Recorded By | Recorded At                   |
+---------+---------+---------+---------+-----------------------------------+---------------------------------------------------------------------------+----------------------+-------------+-------------------------------+
| AE      | ARE     | 784     | 3       | United Arab Emirates              | United Arab Emirates                                                      | common.rectification | newuser3    | 2026-01-10 08:35:13.000000000 |
| AF      | AFG     | 004     | 1       | Afghanistan                       | Islamic Republic of Afghanistan                                           | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| EE      | EST     | 233     | 1       | Estonia                           | Republic of Estonia                                                       | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AI      | AIA     | 660     | 1       | Anguilla                          | Anguilla                                                                  | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AL      | ALB     | 008     | 1       | Albania                           | Republic of Albania                                                       | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AM      | ARM     | 051     | 1       | Armenia                           | Republic of Armenia                                                       | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BS      | BHS     | 044     | 1       | Bahamas                           | Commonwealth of The Bahamas                                               | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AQ      | ATA     | 010     | 1       | Antarctica                        | Antarctica                                                                | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AR      | ARG     | 032     | 1       | Argentina                         | Argentine Republic                                                        | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AS      | ASM     | 016     | 1       | American Samoa                    | American Samoa                                                            | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AT      | AUT     | 040     | 1       | Austria                           | Republic of Austria                                                       | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AU      | AUS     | 036     | 1       | Australia                         | Commonwealth of Australia                                                 | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AW      | ABW     | 533     | 1       | Aruba                             | Aruba                                                                     | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AX      | ALA     | 248     | 1       | Åland Islands                    | Åland Islands                                                            | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AZ      | AZE     | 031     | 1       | Azerbaijan                        | Republic of Azerbaijan                                                    | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BA      | BIH     | 070     | 1       | Bosnia and Herzegovina            | Bosnia and Herzegovina                                                    | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BB      | BRB     | 052     | 1       | Barbados                          | Barbados                                                                  | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BD      | BGD     | 050     | 1       | Bangladesh                        | People's Republic of Bangladesh                                           | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BE      | BEL     | 056     | 1       | Belgium                           | Kingdom of Belgium                                                        | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BF      | BFA     | 854     | 1       | Burkina Faso                      | Burkina Faso                                                              | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BG      | BGR     | 100     | 1       | Bulgaria                          | Republic of Bulgaria                                                      | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BH      | BHR     | 048     | 1       | Bahrain                           | Kingdom of Bahrain                                                        | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BI      | BDI     | 108     | 1       | Burundi                           | Republic of Burundi                                                       | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BJ      | BEN     | 204     | 1       | Benin                             | Republic of Benin                                                         | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BL      | BLM     | 652     | 1       | Saint Barthélemy                 | Saint Barthélemy                                                         | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BM      | BMU     | 060     | 1       | Bermuda                           | Bermuda                                                                   | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BN      | BRN     | 096     | 1       | Brunei                            | Brunei Darussalam                                                         | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BO      | BOL     | 068     | 1       | Bolivia                           | Plurinational State of Bolivia                                            | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BQ      | BES     | 535     | 1       | Bonaire, Sint Eustatius and Saba  | Bonaire, Sint Eustatius and Saba                                          | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BR      | BRA     | 076     | 1       | Brazil                            | Federative Republic of Brazil                                             | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AO      | AGO     | 024     | 1       | Angola                            | Republic of Angola                                                        | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BT      | BTN     | 064     | 1       | Bhutan                            | Kingdom of Bhutan                                                         | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BV      | BVT     | 074     | 1       | Bouvet Island                     | Bouvet Island                                                             | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BW      | BWA     | 072     | 1       | Botswana                          | Republic of Botswana                                                      | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BY      | BLR     | 112     | 1       | Belarus                           | Republic of Belarus                                                       | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| BZ      | BLZ     | 084     | 1       | Belize                            | Belize                                                                    | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CA      | CAN     | 124     | 1       | Canada                            | Canada                                                                    | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CC      | CCK     | 166     | 1       | Cocos (Keeling) Islands           | Cocos (Keeling) Islands                                                   | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CD      | COD     | 180     | 1       | DR Congo                          | Democratic Republic of the Congo                                          | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CF      | CAF     | 140     | 1       | Central African Republic          | Central African Republic                                                  | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CG      | COG     | 178     | 1       | Congo                             | Republic of the Congo                                                     | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CH      | CHE     | 756     | 1       | Switzerland                       | Swiss Confederation                                                       | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CI      | CIV     | 384     | 1       | Côte d'Ivoire                    | Republic of Côte d'Ivoire                                                | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CK      | COK     | 184     | 1       | Cook Islands                      | Cook Islands                                                              | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CL      | CHL     | 152     | 1       | Chile                             | Republic of Chile                                                         | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CM      | CMR     | 120     | 1       | Cameroon                          | Republic of Cameroon                                                      | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CN      | CHN     | 156     | 1       | China                             | People's Republic of China                                                | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CO      | COL     | 170     | 1       | Colombia                          | Republic of Colombia                                                      | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CR      | CRI     | 188     | 1       | Costa Rica                        | Republic of Costa Rica                                                    | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CU      | CUB     | 192     | 1       | Cuba                              | Republic of Cuba                                                          | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CV      | CPV     | 132     | 1       | Cape Verde                        | Republic of Cabo Verde                                                    | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CW      | CUW     | 531     | 1       | Curaçao                          | Curaçao                                                                  | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CX      | CXR     | 162     | 1       | Christmas Island                  | Christmas Island                                                          | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CY      | CYP     | 196     | 1       | Cyprus                            | Republic of Cyprus                                                        | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| CZ      | CZE     | 203     | 1       | Czechia                           | Czech Republic                                                            | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| DE      | DEU     | 276     | 1       | Germany                           | Federal Republic of Germany                                               | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| DJ      | DJI     | 262     | 1       | Djibouti                          | Republic of Djibouti                                                      | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| DK      | DNK     | 208     | 1       | Denmark                           | Kingdom of Denmark                                                        | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| DM      | DMA     | 212     | 1       | Dominica                          | Commonwealth of Dominica                                                  | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| DO      | DOM     | 214     | 1       | Dominican Republic                | Dominican Republic                                                        | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| DZ      | DZA     | 012     | 1       | Algeria                           | People's Democratic Republic of Algeria                                   | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| EC      | ECU     | 218     | 1       | Ecuador                           | Republic of Ecuador                                                       | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AG      | ATG     | 028     | 1       | Antigua and Barbuda               | Antigua and Barbuda                                                       | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| EG      | EGY     | 818     | 1       | Egypt                             | Arab Republic of Egypt                                                    | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| EH      | ESH     | 732     | 1       | Western Sahara                    | Western Sahara                                                            | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| ER      | ERI     | 232     | 1       | Eritrea                           | State of Eritrea                                                          | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| ES      | ESP     | 724     | 1       | Spain                             | Kingdom of Spain                                                          | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| ET      | ETH     | 231     | 1       | Ethiopia                          | Federal Democratic Republic of Ethiopia                                   | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| FI      | FIN     | 246     | 1       | Finland                           | Republic of Finland                                                       | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| FJ      | FJI     | 242     | 1       | Fiji                              | Republic of Fiji                                                          | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| FK      | FLK     | 238     | 1       | Falkland Islands                  | Falkland Islands                                                          | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| FM      | FSM     | 583     | 1       | Micronesia                        | Federated States of Micronesia                                            | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| FO      | FRO     | 234     | 1       | Faroe Islands                     | Faroe Islands                                                             | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| FR      | FRA     | 250     | 1       | France                            | French Republic                                                           | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GA      | GAB     | 266     | 1       | Gabon                             | Gabonese Republic                                                         | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GB      | GBR     | 826     | 1       | United Kingdom                    | United Kingdom of Great Britain and Northern Ireland                      | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GD      | GRD     | 308     | 1       | Grenada                           | Grenada                                                                   | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GE      | GEO     | 268     | 1       | Georgia                           | Georgia                                                                   | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GF      | GUF     | 254     | 1       | French Guiana                     | French Guiana                                                             | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GG      | GGY     | 831     | 1       | Guernsey                          | Bailiwick of Guernsey                                                     | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GH      | GHA     | 288     | 1       | Ghana                             | Republic of Ghana                                                         | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GI      | GIB     | 292     | 1       | Gibraltar                         | Gibraltar                                                                 | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GL      | GRL     | 304     | 1       | Greenland                         | Greenland                                                                 | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GM      | GMB     | 270     | 1       | Gambia                            | Republic of The Gambia                                                    | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GN      | GIN     | 324     | 1       | Guinea                            | Republic of Guinea                                                        | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GP      | GLP     | 312     | 1       | Guadeloupe                        | Guadeloupe                                                                | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GQ      | GNQ     | 226     | 1       | Equatorial Guinea                 | Republic of Equatorial Guinea                                             | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GR      | GRC     | 300     | 1       | Greece                            | Hellenic Republic                                                         | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GS      | SGS     | 239     | 1       | South Georgia                     | South Georgia and the South Sandwich Islands                              | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GT      | GTM     | 320     | 1       | Guatemala                         | Republic of Guatemala                                                     | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GU      | GUM     | 316     | 1       | Guam                              | Guam                                                                      | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GW      | GNB     | 624     | 1       | Guinea-Bissau                     | Republic of Guinea-Bissau                                                 | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| GY      | GUY     | 328     | 1       | Guyana                            | Co-operative Republic of Guyana                                           | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| HK      | HKG     | 344     | 1       | Hong Kong                         | Hong Kong Special Administrative Region of the People's Republic of China | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| HM      | HMD     | 334     | 1       | Heard Island and McDonald Islands | Heard Island and McDonald Islands                                         | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| HN      | HND     | 340     | 1       | Honduras                          | Republic of Honduras                                                      | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| HR      | HRV     | 191     | 1       | Croatia                           | Republic of Croatia                                                       | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| HT      | HTI     | 332     | 1       | Haiti                             | Republic of Haiti                                                         | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| HU      | HUN     | 348     | 1       | Hungary                           | Hungary                                                                   | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
| AD      | AND     | 020     | 1       | Andorra                           | Principality of Andorra                                                   | system.new_record    | system      | 2026-01-09 16:37:38.000000000 |
+---------+---------+---------+---------+-----------------------------------+---------------------------------------------------------------------------+----------------------+-------------+-------------------------------+

ores-shell> Bye!
#+end_example
